//////////////////////////////////////////////
//작성자: 백승희(2113783)
//작성일: 2023-05-18
//Lab10-2: 직원정보 구조체 배열만들기
//////////////////////////////////////////////
#include <stdio.h>
struct employee{   //직원정보 구조체
    char name[20];
    int balance;
};
int main(){
    //구조체 배열 선언, 초기화
    struct employee Employee[3]={ 
        {"홍길동",2000000},
        {"임걱정",3000000},
        {"김영철",2500000}
    };
    for(int i=0;i<3;i++)
        printf("직원이름: %s 월급여: %d\n",Employee[i].name,Employee[i].balance);
    //"."을 이용해서 구조체 항목에 접근
}