//////////////////////////////////////////////
//작성자: 백승희(2113783)
//작성일: 2023-05-25
//Lab11-1: 배열 포인터 이용해서 배열원소값 +10
//////////////////////////////////////////////
#include <stdio.h>
int main(){
    int ary[][5]={2,1,7,9,10,6,3,8,4,5};
    int (*ptr)[5];
    ptr=&ary[0];
    printf("원 행렬값:\n");
    printf("-------------------------------\n");
    for(int j=0;j<2;j++) {
        for(int i=0;i<5;i++)
            printf("|%4d ",(*ptr)[j*5+i]);  //포인터를 이용해서 요소하나씩 접근
        printf("|\n");
    }   
    printf("-------------------------------\n");

    for(int j=0;j<2;j++)
        for(int i=0;i<5;i++)
            (*ptr)[j*5+i]+=10;   //배열의 요소에 10씩 추가

    printf("계산후 행렬값:\n");
    printf("-------------------------------\n");
    for(int j=0;j<2;j++){
        for(int i=0;i<5;i++)
            printf("|%4d ",(*ptr)[i]);  //하나의 열에서 요소 접근
        *ptr++;           //다음 행으로 포인터 이동
        printf("|\n");
    }
    printf("-------------------------------\n");
}