//////////////////////////////////////////////
//작성자: 백승희(2113783)
//작성일: 2023-05-04
//Lab8-5: 이차원배열 포인터를 이용해서 출력하기
//////////////////////////////////////////////
#include <stdio.h>
int main()
{
    int arr[3][4]={{11,22,33,44},
                   {55,66,77,88},
                   {11,66,77,44}};
    int (*p)[4]=arr; //arr행에 접근할수있도록 포인터 설정
    for (int i=0;i<3;i++)
    {
        for(int j=0;j<4;j++)
            printf("arr[%d][%d] = %d  ",i,j,*(*(p+i)+j)); 
            //i번째 행에서 j번째 열 접근
        printf("\n");
    }
}