//////////////////////////////////////////////
//작성자: 백승희(2113783)
//작성일: 2023-03-30
//Lab4-4: 놀이공원 자유이용권 가격 계산하기
//////////////////////////////////////////////
#include <stdio.h>
int main()
{
    int time,n;
    printf("시간을 입력하시오: ");
    scanf("%d",&time);
    printf("나이를 입력하시오: ");
    scanf("%d",&n);
    if (time<17) //시간검사
    {
        if (n>=65 || n>=3&&n<=12) //나이검사, 3~12세는 and연산자로
            printf("25000원\n");
        else
            printf("34000원\n");
    }
    else
        printf("10000원\n");
}