//////////////////////////////////////////////
//작성자: 백승희(2113783)
//작성일: 2023-04-27
//Lab7-4: 2차원배열 행합계,열합계 구하기
//////////////////////////////////////////////
#include <stdio.h>
int main(){
    int sum=0;
    int n[3][5]={{12,56,32,16,98},{99,56,34,41,3},{65,3,87,78,21}};
    for(int i=0;i<3;i++){
        sum=0;
        for (int j=0;j<5;j++)
            sum+=n[i][j];  //행의 합계구하기
        printf("%d행의 합계: %d\n",i,sum);
    }
    for(int i=0;i<5;i++){
        sum=0;
        for (int j=0;j<3;j++)
            sum+=n[j][i];  //열의 합계구하기
        printf("%d열의 합계: %d\n",i,sum);
    }
}